; domain
(define (domain parking)
 (:requirements :strips :typing  )
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

 

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                         
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                         
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                         
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                         
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_00  car_01  car_02  car_03  car_04  car_05  car_06  car_07  car_08  car_09  car_10  car_11  car_12  car_13  car_14  car_15  car_16  car_17  car_18  car_19  car_20  car_21 - car
     curb_00 curb_01 curb_02 curb_03 curb_04 curb_05 curb_06 curb_07 curb_08 curb_09 curb_10 curb_11 - curb
  )
  (:init
     
    (at-curb car_18)
    (at-curb-num car_18 curb_00)
    (behind-car car_13 car_18)
    (car-clear car_13)
    (at-curb car_11)
    (at-curb-num car_11 curb_01)
    (behind-car car_02 car_11)
    (car-clear car_02)
    (at-curb car_07)
    (at-curb-num car_07 curb_02)
    (behind-car car_09 car_07)
    (car-clear car_09)
    (at-curb car_21)
    (at-curb-num car_21 curb_03)
    (behind-car car_08 car_21)
    (car-clear car_08)
    (at-curb car_19)
    (at-curb-num car_19 curb_04)
    (behind-car car_03 car_19)
    (car-clear car_03)
    (at-curb car_05)
    (at-curb-num car_05 curb_05)
    (behind-car car_16 car_05)
    (car-clear car_16)
    (at-curb car_15)
    (at-curb-num car_15 curb_06)
    (behind-car car_12 car_15)
    (car-clear car_12)
    (at-curb car_01)
    (at-curb-num car_01 curb_07)
    (behind-car car_04 car_01)
    (car-clear car_04)
    (at-curb car_10)
    (at-curb-num car_10 curb_08)
    (behind-car car_06 car_10)
    (car-clear car_06)
    (at-curb car_00)
    (at-curb-num car_00 curb_09)
    (behind-car car_14 car_00)
    (car-clear car_14)
    (at-curb car_20)
    (at-curb-num car_20 curb_10)
    (behind-car car_17 car_20)
    (car-clear car_17)
    (curb-clear curb_11)
  )
  (:goal
    (and
      (at-curb-num car_00 curb_00)
      (behind-car car_12 car_00)
      (at-curb-num car_01 curb_01)
      (behind-car car_13 car_01)
      (at-curb-num car_02 curb_02)
      (behind-car car_14 car_02)
      (at-curb-num car_03 curb_03)
      (behind-car car_15 car_03)
      (at-curb-num car_04 curb_04)
      (behind-car car_16 car_04)
      (at-curb-num car_05 curb_05)
      (behind-car car_17 car_05)
      (at-curb-num car_06 curb_06)
      (behind-car car_18 car_06)
      (at-curb-num car_07 curb_07)
      (behind-car car_19 car_07)
      (at-curb-num car_08 curb_08)
      (behind-car car_20 car_08)
      (at-curb-num car_09 curb_09)
      (behind-car car_21 car_09)
      (at-curb-num car_10 curb_10)
      (at-curb-num car_11 curb_11)
    )
  )
 
)
; =========== INIT =========== 
;  curb_00: car_18 car_13 
;  curb_01: car_11 car_02 
;  curb_02: car_07 car_09 
;  curb_03: car_21 car_08 
;  curb_04: car_19 car_03 
;  curb_05: car_05 car_16 
;  curb_06: car_15 car_12 
;  curb_07: car_01 car_04 
;  curb_08: car_10 car_06 
;  curb_09: car_00 car_14 
;  curb_10: car_20 car_17 
;  curb_11: 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_00: car_00 car_12 
;  curb_01: car_01 car_13 
;  curb_02: car_02 car_14 
;  curb_03: car_03 car_15 
;  curb_04: car_04 car_16 
;  curb_05: car_05 car_17 
;  curb_06: car_06 car_18 
;  curb_07: car_07 car_19 
;  curb_08: car_08 car_20 
;  curb_09: car_09 car_21 
;  curb_10: car_10 
;  curb_11: car_11 
; =========== /GOAL =========== 



; =========== INIT =========== 
;  curb_00: car_02 
;  curb_01: car_11 car_14 
;  curb_02: car_07 car_09 
;  curb_03: car_21 car_08 
;  curb_04: car_19 car_03 
;  curb_05: car_05 car_16 
;  curb_06: car_15 car_12
;  curb_07: car_01 car_04 
;  curb_08: car_10 car_06 
;  curb_09: car_13 car_18 
;  curb_10: car_20 car_17 
;  curb_11:  
; ========== /INIT ===========

; plan
1. (move-car-to-curb car_14 car_00 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_14 car_00)
   added: (car-clear car_00) (at-curb-num car_14 curb_11) (at-curb car_14)
   goals met: 1 of 22
2. (move-curb-to-car car_00 curb_09 car_14)
   deleted: (car-clear car_14) (at-curb-num car_00 curb_09) (at-curb car_00)
   added: (curb-clear curb_09) (behind-car car_00 car_14)
   goals met: 1 of 22
3. (move-car-to-curb car_13 car_18 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_13 car_18)
   added: (car-clear car_18) (at-curb-num car_13 curb_09) (at-curb car_13)
   goals met: 1 of 22
4. (move-curb-to-car car_18 curb_00 car_13)
   deleted: (car-clear car_13) (at-curb-num car_18 curb_00) (at-curb car_18)
   added: (curb-clear curb_00) (behind-car car_18 car_13)
   goals met: 1 of 22
5. (move-car-to-curb car_00 car_14 curb_00)
   deleted: (curb-clear curb_00) (behind-car car_00 car_14)
   added: (car-clear car_14) (at-curb-num car_00 curb_00) (at-curb car_00)
   goals met: 2 of 22
6. (move-car-to-car car_12 car_15 car_00)
   deleted: (car-clear car_00) (behind-car car_12 car_15)
   added: (car-clear car_15) (behind-car car_12 car_00)
   goals met: 3 of 22
7. (move-car-to-car car_04 car_01 car_14)
   deleted: (car-clear car_14) (behind-car car_04 car_01)
   added: (car-clear car_01) (behind-car car_04 car_14)
   goals met: 3 of 22
8. (move-curb-to-car car_01 curb_07 car_15)
   deleted: (car-clear car_15) (at-curb-num car_01 curb_07) (at-curb car_01)
   added: (curb-clear curb_07) (behind-car car_01 car_15)
   goals met: 3 of 22
9. (move-car-to-curb car_02 car_11 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_02 car_11)
   added: (car-clear car_11) (at-curb-num car_02 curb_07) (at-curb car_02)
   goals met: 3 of 22
10. (move-curb-to-car car_11 curb_01 car_02)
   deleted: (car-clear car_02) (at-curb-num car_11 curb_01) (at-curb car_11)
   added: (curb-clear curb_01) (behind-car car_11 car_02)
   goals met: 3 of 22
11. (move-car-to-curb car_01 car_15 curb_01)
   deleted: (curb-clear curb_01) (behind-car car_01 car_15)
   added: (car-clear car_15) (at-curb-num car_01 curb_01) (at-curb car_01)
   goals met: 4 of 22
12. (move-car-to-car car_18 car_13 car_15)
   deleted: (car-clear car_15) (behind-car car_18 car_13)
   added: (car-clear car_13) (behind-car car_18 car_15)
   goals met: 4 of 22
13. (move-curb-to-car car_13 curb_09 car_01)
   deleted: (car-clear car_01) (at-curb-num car_13 curb_09) (at-curb car_13)
   added: (curb-clear curb_09) (behind-car car_13 car_01)
   goals met: 5 of 22
14. (move-car-to-curb car_11 car_02 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_11 car_02)
   added: (car-clear car_02) (at-curb-num car_11 curb_09) (at-curb car_11)
   goals met: 5 of 22
15. (move-curb-to-car car_02 curb_07 car_11)
   deleted: (car-clear car_11) (at-curb-num car_02 curb_07) (at-curb car_02)
   added: (curb-clear curb_07) (behind-car car_02 car_11)
   goals met: 5 of 22
16. (move-car-to-curb car_09 car_07 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_09 car_07)
   added: (car-clear car_07) (at-curb-num car_09 curb_07) (at-curb car_09)
   goals met: 5 of 22
17. (move-curb-to-car car_07 curb_02 car_09)
   deleted: (car-clear car_09) (at-curb-num car_07 curb_02) (at-curb car_07)
   added: (curb-clear curb_02) (behind-car car_07 car_09)
   goals met: 5 of 22
18. (move-car-to-curb car_02 car_11 curb_02)
   deleted: (curb-clear curb_02) (behind-car car_02 car_11)
   added: (car-clear car_11) (at-curb-num car_02 curb_02) (at-curb car_02)
   goals met: 6 of 22
19. (move-car-to-car car_04 car_14 car_11)
   deleted: (car-clear car_11) (behind-car car_04 car_14)
   added: (car-clear car_14) (behind-car car_04 car_11)
   goals met: 6 of 22
20. (move-curb-to-car car_14 curb_11 car_02)
   deleted: (car-clear car_02) (at-curb-num car_14 curb_11) (at-curb car_14)
   added: (curb-clear curb_11) (behind-car car_14 car_02)
   goals met: 7 of 22
21. (move-car-to-curb car_08 car_21 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_08 car_21)
   added: (car-clear car_21) (at-curb-num car_08 curb_11) (at-curb car_08)
   goals met: 7 of 22
22. (move-curb-to-car car_21 curb_03 car_08)
   deleted: (car-clear car_08) (at-curb-num car_21 curb_03) (at-curb car_21)
   added: (curb-clear curb_03) (behind-car car_21 car_08)
   goals met: 7 of 22
23. (move-car-to-curb car_03 car_19 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_03 car_19)
   added: (car-clear car_19) (at-curb-num car_03 curb_03) (at-curb car_03)
   goals met: 8 of 22
24. (move-car-to-car car_18 car_15 car_19)
   deleted: (car-clear car_19) (behind-car car_18 car_15)
   added: (car-clear car_15) (behind-car car_18 car_19)
   goals met: 8 of 22
25. (move-curb-to-car car_15 curb_06 car_03)
   deleted: (car-clear car_03) (at-curb-num car_15 curb_06) (at-curb car_15)
   added: (curb-clear curb_06) (behind-car car_15 car_03)
   goals met: 9 of 22
26. (move-car-to-curb car_18 car_19 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_18 car_19)
   added: (car-clear car_19) (at-curb-num car_18 curb_06) (at-curb car_18)
   goals met: 9 of 22
27. (move-curb-to-car car_19 curb_04 car_18)
   deleted: (car-clear car_18) (at-curb-num car_19 curb_04) (at-curb car_19)
   added: (curb-clear curb_04) (behind-car car_19 car_18)
   goals met: 9 of 22
28. (move-car-to-curb car_04 car_11 curb_04)
   deleted: (curb-clear curb_04) (behind-car car_04 car_11)
   added: (car-clear car_11) (at-curb-num car_04 curb_04) (at-curb car_04)
   goals met: 10 of 22
29. (move-car-to-car car_16 car_05 car_04)
   deleted: (car-clear car_04) (behind-car car_16 car_05)
   added: (car-clear car_05) (behind-car car_16 car_04)
   goals met: 11 of 22
30. (move-car-to-car car_17 car_20 car_05)
   deleted: (car-clear car_05) (behind-car car_17 car_20)
   added: (car-clear car_20) (behind-car car_17 car_05)
   goals met: 12 of 22
31. (move-car-to-car car_19 car_18 car_20)
   deleted: (car-clear car_20) (behind-car car_19 car_18)
   added: (car-clear car_18) (behind-car car_19 car_20)
   goals met: 12 of 22
32. (move-curb-to-car car_18 curb_06 car_11)
   deleted: (car-clear car_11) (at-curb-num car_18 curb_06) (at-curb car_18)
   added: (curb-clear curb_06) (behind-car car_18 car_11)
   goals met: 12 of 22
33. (move-car-to-curb car_06 car_10 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_06 car_10)
   added: (car-clear car_10) (at-curb-num car_06 curb_06) (at-curb car_06)
   goals met: 13 of 22
34. (move-car-to-car car_18 car_11 car_06)
   deleted: (car-clear car_06) (behind-car car_18 car_11)
   added: (car-clear car_11) (behind-car car_18 car_06)
   goals met: 14 of 22
35. (move-car-to-car car_07 car_09 car_11)
   deleted: (car-clear car_11) (behind-car car_07 car_09)
   added: (car-clear car_09) (behind-car car_07 car_11)
   goals met: 14 of 22
36. (move-curb-to-car car_09 curb_07 car_10)
   deleted: (car-clear car_10) (at-curb-num car_09 curb_07) (at-curb car_09)
   added: (curb-clear curb_07) (behind-car car_09 car_10)
   goals met: 14 of 22
37. (move-car-to-curb car_07 car_11 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_07 car_11)
   added: (car-clear car_11) (at-curb-num car_07 curb_07) (at-curb car_07)
   goals met: 15 of 22
38. (move-car-to-car car_19 car_20 car_07)
   deleted: (car-clear car_07) (behind-car car_19 car_20)
   added: (car-clear car_20) (behind-car car_19 car_07)
   goals met: 16 of 22
39. (move-car-to-car car_21 car_08 car_11)
   deleted: (car-clear car_11) (behind-car car_21 car_08)
   added: (car-clear car_08) (behind-car car_21 car_11)
   goals met: 16 of 22
40. (move-curb-to-car car_08 curb_11 car_20)
   deleted: (car-clear car_20) (at-curb-num car_08 curb_11) (at-curb car_08)
   added: (curb-clear curb_11) (behind-car car_08 car_20)
   goals met: 16 of 22
41. (move-car-to-curb car_09 car_10 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_09 car_10)
   added: (car-clear car_10) (at-curb-num car_09 curb_11) (at-curb car_09)
   goals met: 16 of 22
42. (move-curb-to-car car_10 curb_08 car_09)
   deleted: (car-clear car_09) (at-curb-num car_10 curb_08) (at-curb car_10)
   added: (curb-clear curb_08) (behind-car car_10 car_09)
   goals met: 16 of 22
43. (move-car-to-curb car_08 car_20 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_08 car_20)
   added: (car-clear car_20) (at-curb-num car_08 curb_08) (at-curb car_08)
   goals met: 17 of 22
44. (move-curb-to-car car_20 curb_10 car_08)
   deleted: (car-clear car_08) (at-curb-num car_20 curb_10) (at-curb car_20)
   added: (curb-clear curb_10) (behind-car car_20 car_08)
   goals met: 18 of 22
45. (move-car-to-curb car_10 car_09 curb_10)
   deleted: (curb-clear curb_10) (behind-car car_10 car_09)
   added: (car-clear car_09) (at-curb-num car_10 curb_10) (at-curb car_10)
   goals met: 19 of 22
46. (move-curb-to-car car_09 curb_11 car_10)
   deleted: (car-clear car_10) (at-curb-num car_09 curb_11) (at-curb car_09)
   added: (curb-clear curb_11) (behind-car car_09 car_10)
   goals met: 19 of 22
47. (move-car-to-curb car_21 car_11 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_21 car_11)
   added: (car-clear car_11) (at-curb-num car_21 curb_11) (at-curb car_21)
   goals met: 19 of 22
48. (move-curb-to-car car_11 curb_09 car_21)
   deleted: (car-clear car_21) (at-curb-num car_11 curb_09) (at-curb car_11)
   added: (curb-clear curb_09) (behind-car car_11 car_21)
   goals met: 19 of 22
49. (move-car-to-curb car_09 car_10 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_09 car_10)
   added: (car-clear car_10) (at-curb-num car_09 curb_09) (at-curb car_09)
   goals met: 20 of 22
50. (move-car-to-car car_11 car_21 car_10)
   deleted: (car-clear car_10) (behind-car car_11 car_21)
   added: (car-clear car_21) (behind-car car_11 car_10)
   goals met: 20 of 22
51. (move-curb-to-car car_21 curb_11 car_09)
   deleted: (car-clear car_09) (at-curb-num car_21 curb_11) (at-curb car_21)
   added: (curb-clear curb_11) (behind-car car_21 car_09)
   goals met: 21 of 22
52. (move-car-to-curb car_11 car_10 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_11 car_10)
   added: (car-clear car_10) (at-curb-num car_11 curb_11) (at-curb car_11)
   goals met: 22 of 22
